Ones/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<BasedOn>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЛистОжидания</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистОжидания</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходыЗвонка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УспешностьЗвонка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокНачат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьРазговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьВидЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фонВидыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Ones/CommonModules/ОповещенияПользователей/Ext/Module.bsl
//dmarenin
&НаКлиенте
Процедура СтартоватьОжиданиеОповещений() экспорт
	
	#Если НаКлиенте Тогда	
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
			
			Возврат;

		КонецЕсли;
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.СокетВК", "Socket", ТипВнешнейКомпоненты.Native);
		Если Не РезультатПодключения Тогда 
			
			УстановитьВнешнююКомпоненту("ОбщийМакет.СокетВК");
			
		КонецЕсли;
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.СокетВК", "Socket", ТипВнешнейКомпоненты.Native);
		Если Не РезультатПодключения Тогда 
			
			Сообщить("Ошибка подключения внешней компоненты для работы с сокетом");
			
			Возврат;
			
		КонецЕсли;
		
		Попытка		
			
			Сокет = Новый("AddIn.Socket.EventListener");
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
			Возврат;
			
		КонецПопытки;
		
		Попытка
			
			Сокет.хост = "192.168.180.150";
			Сокет.ссылка = ПолучитьНавиСсылкуКлиент(Пользователи.ТекущийПользователь());
			
			Сокет.Подключить();
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
			Возврат;
			
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры
//dmarenin

//dmarenin
&НаКлиенте
Функция ПолучитьНавиСсылкуКлиент(Ссылка) экспорт
	
	НавиСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
	ПоискПозиции = Найти(НавиСсылка, "ref=");
	НавиСсылка = Прав(НавиСсылка, стрДлина(НавиСсылка) - (ПоискПозиции + 3));
	
	Возврат НавиСсылка;
	
КонецФункции
//dmarenin

//dmarenin
&НаСервере
Функция ПолучитьТекущегоПользователя()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции
//dmarenin

//dmarenin
&НаКлиенте
Процедура ОбработкаВнешнегоСобытияСокет(Источник, Событие, ДанныеСобытия) Экспорт 
	
	//Сообщить(Источник+" -> "+ДанныеСобытия);
	
	Если Сред(ДанныеСобытия, 0,13)="Connected to " Тогда 
		
		РаботаСВебСервисом.ПривязатьНомерТелефонаКСокету();
		
	Иначе
		
		Данные = JSON.лПрочитатьJSON(ДанныеСобытия);
		
		Если Данные["event"]="ringing" Тогда 
			
			ОписаниеСобытия = РаботаСВебСервисом.ПолучитьОписаниеСобытия(Данные["ref"]);
			Если ОписаниеСобытия.Событие.Пустая() Тогда 
				Возврат;
			КонецЕсли;
			
			Пояснение = ОписаниеСобытия.НомерТелефона+Символы.ПС+Строка(ОписаниеСобытия.Клиент); 
			
			Текст = "Входящий звонок";
			
			ПоказатьОповещениеПользователя(Текст, ПолучитьНавигационнуюСсылку(ОписаниеСобытия.Событие), Пояснение, БиблиотекаКартинок.бтНачатьРазговор, СтатусОповещенияПользователя.Информация);
			
			
			ПараметрыОткрытия = Новый Структура;
			
			ПараметрыОткрытия.Вставить("Ключ", ОписаниеСобытия.Событие);
			
			ОткрытьФорму("Документ.Событие.Форма.ФормаВходящегоЗвонка", ПараметрыОткрытия);
			
		ИначеЕсли Данные["event"]="call_up" Тогда 
			
			Событие = РаботаСВебСервисом.ПолучитьСобытиеПоИд(Данные["unique_id"]);
			Если Событие=Неопределено Тогда 
				Возврат;
			КонецЕсли;
			
			ПараметрыОткрытия = Новый Структура;
			
			ПараметрыОткрытия.Вставить("Ключ", Событие);
			
			ОткрытьФорму("Документ.Событие.Форма.ФормаВходящегоЗвонка", ПараметрыОткрытия);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//dmarenin
